/// <reference path="../types/map.d.ts"/>

/** @type {MapInfo} */
const map = {
  floors: [
    {
      floorFile: "map/floor2.svg",
      floorName: "1階",
      rooms: [
        {
          name: "部屋1",
          lineDot: [458, 418],
          bounds: [[461, 421], [480, 414]],
        },
        {
          name: "部屋2",
          lineDot: [470, 433],
          bounds: [[461, 430], [480, 422]],
        },
        {
          name: "部屋3",
          lineDot: [445, 194],
          bounds: [[410, 191], [452, 76]],
        },
        {
          name: "部屋4",
          lineDot: [445, 199],
          bounds: [[410, 208], [442, 191]],
        },
        {
          name: "部屋5",
          lineDot: [445, 242],
          bounds: [[410, 276], [442, 208]],
        },
        {
          name: "部屋6",
          lineDot: [445, 285],
          bounds: [[410, 293], [442, 277]],
        },
        {
          name: "部屋7",
          lineDot: [445, 310],
          bounds: [[410, 327], [442, 294]],
        },
        {
          name: "部屋8",
          lineDot: [445, 353],
          bounds: [[410, 378], [442, 328]],
        },
        {
          name: "部屋9",
          lineDot: [445, 388],
          bounds: [[410, 396], [442, 379]],
        },
        {
          name: "部屋10",
          lineDot: [445, 413],
          bounds: [[410, 430], [442, 396]],
        },
        {
          name: "部屋11",
          lineDot: [432, 444],
          bounds: [[410, 481], [453, 447]],
        },
        {
          name: "部屋12",
          lineDot: [341, 185],
          bounds: [[313, 182], [355, 102]],
        },
        {
          name: "部屋13",
          lineDot: [348, 576],
          bounds: [[313, 618], [355, 579]],
        },
        {
          name: "部屋14",
          bounds: [[313, 635], [355, 619]],
        },
        {
          name: "部屋15",
          lineDot: [336, 204],
          bounds: [[312, 225], [332, 183]],
        },
        {
          name: "部屋16",
          lineDot: [348, 246],
          bounds: [[313, 268], [344, 225]],
        },
        {
          name: "部屋17",
          lineDot: [347, 278],
          bounds: [[313, 289], [344, 268]],
        },
        {
          name: "部屋18",
          lineDot: [348, 300],
          bounds: [[313, 310], [344, 290]],
        },
        {
          name: "部屋19",
          lineDot: [348, 332],
          bounds: [[313, 353], [344, 310]],
        },
        {
          name: "部屋20",
          lineDot: [348, 375],
          bounds: [[313, 396], [344, 353]],
        },
        {
          name: "部屋21",
          lineDot: [348, 400],
          bounds: [[313, 404], [344, 396]],
        },
        {
          name: "部屋22",
          lineDot: [335, 416],
          bounds: [[313, 413], [344, 405]],
        },
        {
          name: "部屋23",
          lineDot: [340, 473],
          bounds: [[312, 516], [336, 430]],
        },
        {
          name: "部屋24",
          lineDot: [348, 526],
          bounds: [[313, 536], [344, 516]],
        },
        {
          name: "部屋25",
          lineDot: [348, 547],
          bounds: [[313, 558], [344, 537]],
        },
        {
          name: "部屋26",
          lineDot: [348, 569],
          bounds: [[313, 579], [344, 559]],
        },
        {
          name: "部屋27",
          lineDot: [331, 421],
          bounds: [[313, 430], [328, 413]],
        },
      ],
    },
    {
      floorFile: "map/floor3.svg",
      floorName: "2階",
      rooms: [
        {
          name: "部屋1",
          lineDot: [462, 411],
          bounds: [[465, 414], [484, 407]],
        },
        {
          name: "部屋2",
          lineDot: [475, 425],
          bounds: [[465, 422], [484, 415]],
        },
        {
          name: "部屋3",
          lineDot: [450, 154],
          bounds: [[416, 151], [457, 71]],
        },
        {
          name: "部屋4",
          lineDot: [450, 168],
          bounds: [[416, 185], [446, 152]],
        },
        {
          name: "部屋5",
          lineDot: [450, 210],
          bounds: [[416, 236], [446, 185]],
        },
        {
          name: "部屋6",
          lineDot: [450, 245],
          bounds: [[416, 253], [446, 237]],
        },
        {
          name: "部屋7",
          lineDot: [450, 279],
          bounds: [[416, 304], [446, 253]],
        },
        {
          name: "部屋8",
          lineDot: [450, 329],
          bounds: [[416, 355], [446, 304]],
        },
        {
          name: "部屋9",
          lineDot: [450, 363],
          bounds: [[416, 372], [446, 355]],
        },
        {
          name: "部屋10",
          lineDot: [450, 381],
          bounds: [[416, 389], [446, 372]],
        },
        {
          name: "部屋11",
          lineDot: [450, 398],
          bounds: [[416, 406], [446, 390]],
        },
        {
          name: "部屋12",
          lineDot: [430, 426],
          bounds: [[416, 423], [446, 406]],
        },
        {
          name: "部屋13",
          lineDot: [436, 436],
          bounds: [[416, 474], [457, 440]],
        },
        {
          name: "部屋14",
          lineDot: [353, 179],
          bounds: [[319, 176], [360, 97]],
        },
        {
          name: "部屋15",
          lineDot: [353, 607],
          bounds: [[319, 627], [360, 610]],
        },
        {
          name: "部屋16",
          lineDot: [353, 185],
          bounds: [[319, 193], [349, 177]],
        },
        {
          name: "部屋17",
          lineDot: [353, 200],
          bounds: [[319, 206], [349, 194]],
        },
        {
          name: "部屋18",
          lineDot: [353, 212],
          bounds: [[319, 219], [349, 207]],
        },
        {
          name: "部屋19",
          lineDot: [353, 229],
          bounds: [[319, 240], [349, 219]],
        },
        {
          name: "部屋20",
          lineDot: [353, 251],
          bounds: [[319, 261], [349, 241]],
        },
        {
          name: "部屋21",
          lineDot: [353, 283],
          bounds: [[319, 304], [349, 262]],
        },
        {
          name: "部屋22",
          lineDot: [353, 314],
          bounds: [[319, 325], [349, 304]],
        },
        {
          name: "部屋23",
          lineDot: [352, 332],
          bounds: [[334, 338], [349, 325]],
        },
        {
          name: "部屋24",
          lineDot: [353, 342],
          bounds: [[334, 346], [349, 338]],
        },
        {
          name: "部屋25",
          lineDot: [353, 368],
          bounds: [[319, 389], [349, 347]],
        },
        {
          name: "部屋26",
          lineDot: [353, 398],
          bounds: [[319, 406], [349, 390]],
        },
        {
          name: "部屋27",
          lineDot: [353, 414],
          bounds: [[319, 422], [349, 406]],
        },
        {
          name: "部屋28",
          lineDot: [353, 432],
          bounds: [[319, 440], [349, 423]],
        },
        {
          name: "部屋29",
          lineDot: [353, 461],
          bounds: [[319, 482], [349, 440]],
        },
        {
          name: "部屋30",
          lineDot: [353, 503],
          bounds: [[319, 525], [349, 483]],
        },
        {
          name: "部屋31",
          lineDot: [353, 546],
          bounds: [[319, 567], [349, 525]],
        },
        {
          name: "部屋32",
          lineDot: [353, 589],
          bounds: [[319, 610], [349, 568]],
        },
        {
          name: "部屋33",
          bounds: [[319, 346], [334, 325]],
        },
      ],
    },
    {
      floorFile: "map/floor4.svg",
      floorName: "3階",
      rooms: [
        {
          name: "部屋1",
          lineDot: [443, 430],
          bounds: [[446, 435], [465, 427]],
        },
        {
          name: "部屋2",
          lineDot: [455, 446],
          bounds: [[446, 443], [465, 435]],
        },
        {
          name: "部屋3",
          lineDot: [429, 216],
          bounds: [[393, 213], [437, 77]],
        },
        {
          name: "部屋4",
          lineDot: [415, 457],
          bounds: [[393, 496], [437, 461]],
        },
        {
          name: "部屋5",
          lineDot: [429, 240],
          bounds: [[393, 266], [426, 214]],
        },
        {
          name: "部屋6",
          lineDot: [429, 276],
          bounds: [[393, 284], [426, 267]],
        },
        {
          name: "部屋7",
          lineDot: [429, 293],
          bounds: [[393, 302], [426, 285]],
        },
        {
          name: "部屋8",
          lineDot: [429, 328],
          bounds: [[393, 355], [426, 302]],
        },
        {
          name: "部屋9",
          lineDot: [429, 381],
          bounds: [[393, 408], [426, 355]],
        },
        {
          name: "部屋10",
          lineDot: [429, 417],
          bounds: [[393, 426], [426, 409]],
        },
        {
          name: "部屋11",
          lineDot: [409, 446],
          bounds: [[393, 443], [426, 426]],
        },
        {
          name: "部屋12",
          lineDot: [397, 453],
          bounds: [[361, 461], [393, 444]],
        },
        {
          name: "部屋13",
          lineDot: [328, 190],
          bounds: [[292, 187], [336, 104]],
        },
        {
          name: "部屋14",
          lineDot: [328, 635],
          bounds: [[292, 656], [336, 638]],
        },
        {
          name: "部屋15",
          lineDot: [328, 209],
          bounds: [[292, 231], [325, 187]],
        },
        {
          name: "部屋16",
          lineDot: [328, 253],
          bounds: [[292, 275], [325, 231]],
        },
        {
          name: "部屋17",
          lineDot: [328, 297],
          bounds: [[292, 319], [325, 276]],
        },
        {
          name: "部屋18",
          lineDot: [328, 330],
          bounds: [[292, 341], [325, 320]],
        },
        {
          name: "部屋19",
          lineDot: [328, 352],
          bounds: [[292, 364], [325, 342]],
        },
        {
          name: "部屋20",
          lineDot: [328, 386],
          bounds: [[292, 408], [325, 364]],
        },
        {
          name: "部屋21",
          lineDot: [328, 417],
          bounds: [[292, 426], [325, 409]],
        },
        {
          name: "部屋22",
          lineDot: [328, 434],
          bounds: [[292, 443], [325, 426]],
        },
        {
          name: "部屋23",
          lineDot: [328, 453],
          bounds: [[292, 461], [325, 444]],
        },
        {
          name: "部屋24",
          lineDot: [328, 483],
          bounds: [[292, 505], [325, 462]],
        },
        {
          name: "部屋25",
          lineDot: [328, 527],
          bounds: [[292, 549], [325, 506]],
        },
        {
          name: "部屋26",
          lineDot: [328, 572],
          bounds: [[292, 594], [325, 550]],
        },
        {
          name: "部屋27",
          lineDot: [328, 616],
          bounds: [[292, 638], [325, 595]],
        },
      ],
    },
    {
      floorFile: "map/floor5.svg",
      floorName: "4階",
      rooms: [
        {
          name: "部屋1",
          lineDot: [452, 435],
          bounds: [[455, 439], [475, 432]],
        },
        {
          name: "部屋2",
          lineDot: [465, 451],
          bounds: [[455, 448], [475, 440]],
        },
        {
          name: "部屋3",
          lineDot: [439, 258],
          bounds: [[404, 255], [447, 85]],
        },
        {
          name: "部屋4",
          lineDot: [450, 458],
          bounds: [[404, 501], [447, 444]],
        },
        {
          name: "部屋5",
          lineDot: [439, 264],
          bounds: [[404, 272], [436, 255]],
        },
        {
          name: "部屋6",
          lineDot: [439, 325],
          bounds: [[404, 378], [436, 273]],
        },
        {
          name: "部屋7",
          lineDot: [439, 396],
          bounds: [[404, 413], [436, 378]],
        },
        {
          name: "部屋8",
          lineDot: [439, 422],
          bounds: [[404, 430], [436, 414]],
        },
        {
          name: "部屋9",
          lineDot: [439, 437],
          bounds: [[404, 443], [436, 431]],
        },
        {
          name: "部屋10",
          lineDot: [338, 196],
          bounds: [[303, 193], [346, 111]],
        },
        {
          name: "部屋11",
          lineDot: [338, 215],
          bounds: [[303, 237], [335, 194]],
        },
        {
          name: "部屋12",
          lineDot: [338, 259],
          bounds: [[303, 281], [335, 237]],
        },
        {
          name: "部屋13",
          lineDot: [338, 303],
          bounds: [[303, 325], [335, 282]],
        },
        {
          name: "部屋14",
          lineDot: [338, 347],
          bounds: [[303, 369], [335, 325]],
        },
        {
          name: "部屋15",
          lineDot: [338, 391],
          bounds: [[303, 413], [335, 369]],
        },
        {
          name: "部屋16",
          lineDot: [338, 422],
          bounds: [[303, 430], [335, 414]],
        },
        {
          name: "部屋17",
          lineDot: [338, 439],
          bounds: [[303, 448], [335, 431]],
        },
        {
          name: "部屋18",
          lineDot: [338, 457],
          bounds: [[303, 466], [335, 448]],
        },
        {
          name: "部屋19",
          lineDot: [338, 488],
          bounds: [[303, 509], [335, 466]],
        },
        {
          name: "部屋20",
          lineDot: [338, 531],
          bounds: [[303, 553], [335, 510]],
        },
        {
          name: "部屋21",
          lineDot: [338, 576],
          bounds: [[303, 598], [335, 554]],
        },
        {
          name: "部屋22",
          lineDot: [338, 620],
          bounds: [[303, 641], [335, 598]],
        },
        {
          name: "部屋23",
          lineDot: [338, 638],
          bounds: [[303, 659], [346, 642]],
        },
      ],
    },
  ],
};

export default map;
